<a href="https://colab.research.google.com/github/sebagit914/Challenge01/blob/master/Groupby.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [2]:
from google.colab import drive
drive.mount('/content/drive')

Drive already mounted at /content/drive; to attempt to forcibly remount, call drive.mount("/content/drive", force_remount=True).

In [3]:
import numpy as np
import pandas as pd

01. Cambiar el nombre de las columnas

Cambia el nombre de la columna 0 a «ID_Flujo»

Cambia el nombre de la columna 1 a «Fecha»

Cambia el nombre de la columna 2 a «Hora»

Cambia el nombre de la columna 3 a «Conteo»

In [10]:
import pandas as pd
filename = '/content/drive/MyDrive/PTDataScience/PandasForDataManipulation/CalIt2.data.csv'
df = np.array(pd.read_csv(filename))

In [11]:
# Al revisar el tipo de datos, es posible observar que se trata de una matriz array. Por lo tanto, debemos transformarla en DF y nombrar las etiquetas.
df1 = pd.DataFrame(df, columns = ['ID_Flujo','Fecha','Hora','Conteo'])
df1

      ID_Flujo     Fecha      Hora Conteo
0            9  07/24/05  00:00:00      0
1            7  07/24/05  00:30:00      1
2            9  07/24/05  00:30:00      0
3            7  07/24/05  01:00:00      0
4            9  07/24/05  01:00:00      0
...        ...       ...       ...    ...
10074        9  11/05/05  22:30:00      0
10075        7  11/05/05  23:00:00      0
10076        9  11/05/05  23:00:00      0
10077        7  11/05/05  23:30:00      1
10078        9  11/05/05  23:30:00      0

[10079 rows x 4 columns]

02. Seleccionar datos

Selecciona todos los datos para la fecha del 24 de Julio de 2005 que tengan un número de identificación de flujo = 7.

De los datos seleccionados en el paso 1, clasifica los resultados de conteo en orden descendiente y crea el formato de salida de las 10 filas superiores. Asigna el formato de salida a una variable llamada top10.

In [12]:
#Se verifica que la columna fecha esté en datetime
df1.dtypes

ID_Flujo    object
Fecha       object
Hora        object
Conteo      object
dtype: object

In [13]:
#La columna fecha no está en datetime. Por lo tanto, se transforma a date
df1["Fecha"]= pd.to_datetime(df1["Fecha"])

In [14]:
df1.dtypes

ID_Flujo            object
Fecha       datetime64[ns]
Hora                object
Conteo              object
dtype: object

In [15]:
df1.head()

  ID_Flujo      Fecha      Hora Conteo
0        9 2005-07-24  00:00:00      0
1        7 2005-07-24  00:30:00      1
2        9 2005-07-24  00:30:00      0
3        7 2005-07-24  01:00:00      0
4        9 2005-07-24  01:00:00      0

In [16]:
#Se aplican los 2 filtros requeridos:

filtro1 = (df1['Fecha']>'2005-07-24')
filtro2 = (df1['ID_Flujo']==7)
filtro3 = df1.loc[filtro1 & filtro2, : ]
filtro3

      ID_Flujo      Fecha      Hora Conteo
95           7 2005-07-25  00:00:00      1
97           7 2005-07-25  00:30:00      0
99           7 2005-07-25  01:00:00      0
101          7 2005-07-25  01:30:00      0
103          7 2005-07-25  02:00:00      0
...        ...        ...       ...    ...
10069        7 2005-11-05  21:30:00      0
10071        7 2005-11-05  22:00:00      3
10073        7 2005-11-05  22:30:00      0
10075        7 2005-11-05  23:00:00      0
10077        7 2005-11-05  23:30:00      1

[4992 rows x 4 columns]

De los datos seleccionados en el paso 1, clasifica los resultados de conteo en orden descendiente y crea el formato de salida de las 10 filas superiores. Asigna el formato de salida a una variable llamada top10.

In [17]:
filtro3['Conteo']

df2 = filtro3.sort_values('Conteo',ascending=False)
Top10 = df2.head(10)
Top10

     ID_Flujo      Fecha      Hora Conteo
9685        7 2005-11-01  21:30:00     54
9681        7 2005-11-01  20:30:00     54
6877        7 2005-10-03  15:30:00     52
6879        7 2005-10-03  16:00:00     49
3619        7 2005-08-30  17:00:00     47
8907        7 2005-10-24  19:00:00     43
9673        7 2005-11-01  18:30:00     42
1127        7 2005-08-04  18:00:00     40
9683        7 2005-11-01  21:00:00     40
2461        7 2005-08-18  15:30:00     39

03. Función Apply

Para las 10 filas sacadas arriba, usa la función Apply de pandas para restar el valor menor de los 10 de todos ellos y luego saca el valor promedio de los conteos resultantes.

In [19]:
Top10['Conteo'].apply(lambda x:x-39)
Top10

     ID_Flujo      Fecha      Hora Conteo
9685        7 2005-11-01  21:30:00     54
9681        7 2005-11-01  20:30:00     54
6877        7 2005-10-03  15:30:00     52
6879        7 2005-10-03  16:00:00     49
3619        7 2005-08-30  17:00:00     47
8907        7 2005-10-24  19:00:00     43
9673        7 2005-11-01  18:30:00     42
1127        7 2005-08-04  18:00:00     40
9683        7 2005-11-01  21:00:00     40
2461        7 2005-08-18  15:30:00     39